AuditLogs
| where OperationName has "Change user password"
| extend TargetUsername = tostring(TargetResources[0].userPrincipalName)
| where TargetUsername has "username@domain.com" // Replace with username